export const loginRules = [
    (v: string) => !!v || 'Логін не може бути пустим',
    (v: string) => /^[a-z0-9]+$/i.test(v) || 'Логін повинен містити тільки латинські літери та цифри',
    (v: string) => v.length >= 3 || 'Логін повинен бути більше 3 символів',
    (v: string) => v.length <= 20 || 'Логін повинен бути менше 64 символів',
]

export const passwordRules = [
    (v: string) => !!v || 'Пароль не може бути пустим',
    (v: string) => v.length >= 8 || 'Пароль повинен бути більше 8 символів',
    (v: string) => v.length <= 64 || 'Пароль повинен бути менше 64 символів',
]
